Autodesk.Revit.DB.BuiltInFailures.IlluminationFailures.RoomLightLossFactorWarning
Estimated Illumination failed. Light Loss factor not set for lighting fixture.

Autodesk.Revit.DB.BuiltInFailures.IlluminationFailures.RoomCoefficientUtilizationWarning
Estimated Illumination failed. Coefficient of utilization not set for lighting fixture.

Autodesk.Revit.DB.BuiltInFailures.IlluminationFailures.LightingFixtureLumensWarning
Estimated Illumination failed. Lumens not set for lighting fixture.

Autodesk.Revit.DB.BuiltInFailures.IlluminationFailures.IESFileNotFoundWarning
Estimated Illumination failed. IES file not found for lighting fixture.

Autodesk.Revit.DB.BuiltInFailures.IlluminationFailures
Failures about Illumination.